In [1]:
# Import dependencies
import pandas as pd

In [2]:
housing_df = pd.read_csv("resources/WAKE_COUNTY_HOUSING_DATA.csv", index_col=0)
housing_df = housing_df.fillna("OTHER")
housing_df.head()

,SITE_ADDRE,CITY,ZIP_CODE,ZONING,SALE_PRICE,SALE_DATE,BILLING_CLASS,YEAR_BUILT,UNITS,DESIGN_STYLE
8,2457 BERTIE DR,RALEIGH,27610,R-4,"34,500",1/1/1974,2,1964,1,I
9,2848 PROVIDENCE RD,RALEIGH,27610,R-4,"35,500",5/18/1983,2,1970,1,A
10,409 S LAKESIDE DR,RALEIGH,27606,R-4,0,OTHER,2,1999,1,A
11,540 MARSHBURN RD,WENDELL,27591,R3,"37,500",9/16/2004,2,1900,1,A
13,1612 BENNETT ST,RALEIGH,27604,R-4,"5,000",1/1/1971,2,0,0,OTHER

In [3]:
noise_df = pd.read_csv("resources/Wake_Air_Noise_Cleaned.csv", usecols=["TOTAL_VALU", "AIR_NOISE", "SITE_ADDRE"])
noise_df.head()

   TOTAL_VALU                SITE_ADDRE  AIR_NOISE
0       27500           5626 HICKORY LN          0
1      292588      104 MADISON GROVE PL          0
2      409131  3038 KILARNEY RIDGE LOOP          0
3      256470      4608 SILVER CHARM DR          0
4      475623           1328 PLUNKET DR          0

In [4]:
#Load crime dataframe
# NOTE: will require editing to add to machine learning model; is by city, not on a single-property level
crime_df = pd.read_csv("resources/Wake_County_Crime_Data.csv")
crime_df.rename(columns={"TOTAL_REPORTED_VIOLENT_CRIMES": "VIOLENT_CRIMES", "TOTAL_REPORTED_PROPERTY_CRIMES": "PROPERTY_CRIMES"}, inplace=True)
crime_df.head()

            CITY   YEAR_RANGE  VIOLENT_CRIMES  PROPERTY_CRIMES  TOTAL_CRIMES
0           Apex  2011 - 2021             379             6054          6433
1           Cary  2011 - 2021            1262            19726         20988
2  Fuquay Varina  2011 - 2021             440             4430          4870
3      Garner     2011 - 2021             837            11988         12825
4  Holly Springs  2011 - 2021             251             3403          3654

In [5]:
print(f'housing_df: {housing_df.shape}')
print(f'noise_df: {noise_df.shape}')
print(f'crime_df: {crime_df.shape}')

housing_df: (348163, 10)
noise_df: (406038, 3)
crime_df: (12, 5)

In [6]:
print(housing_df['SITE_ADDRE'].nunique())
print(noise_df['SITE_ADDRE'].nunique())
print(crime_df['CITY'].nunique())

336639
392938
12

In [7]:
housing_df.drop_duplicates(subset=["SITE_ADDRE"], keep='first', inplace=True)
print(housing_df.shape)
print(housing_df.nunique())

(336639, 10)
SITE_ADDRE       336639
CITY                 20
ZIP_CODE             40
ZONING              280
SALE_PRICE         3626
SALE_DATE         10405
BILLING_CLASS         1
YEAR_BUILT          182
UNITS                48
DESIGN_STYLE         16
dtype: int64

In [8]:
noise_df.drop_duplicates(subset=["SITE_ADDRE"], keep='first', inplace=True)
print(noise_df.shape)
print(noise_df.nunique())

(392938, 3)
TOTAL_VALU    250708
SITE_ADDRE    392938
AIR_NOISE          5
dtype: int64

In [9]:
housing_df.to_csv('resources/housing_data.csv', index=False)
noise_df.to_csv('resources/noise_data.csv', index=False)
crime_df.to_csv('resources/crime_data.csv', index=False)